
#Область ОбработчикиСобытийФормы

&НаСервере 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		//Объект.УправляющаяКомпания = Справочники.Контрагенты.УправляющаяКомпанияПоУмолчанию();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НаименованиеНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, ПолучитьСборкуНаименования(), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получет сборку наименования
//
// Параметры:
//  Отсутствуют
//
// Возвращаемое значение:
//   СписокЗначений
//
&НаКлиенте
Функция ПолучитьСборкуНаименования()
	
	СЗ = Новый СписокЗначений;
	
	// Стандартная
	НомерНорм = СокрЛП(Объект.Код);
	
	Если НомерНорм <> "" тогда
		НомерНорм = ?(Найти(НомерНорм, "№")=0, "№" + НомерНорм, НомерНорм);
	КонецЕсли;
	Сборка1 = НомерНорм + ?(Объект.ДатаНачала = '00010101', "", " от " + Строка(Формат(Объект.ДатаНачала, "ДЛФ=DD")));
	Сборка1 = Сборка1+?(Объект.УправляющаяКомпания.Пустая(), "", " "+Строка(Объект.УправляющаяКомпания));  
		
	СЗ.Добавить(Сборка1);
	СЗ.Добавить(НомерНорм + ?(Объект.ДатаНачала = '00010101', "", " от " + Строка(Формат(Объект.ДатаНачала, "ДЛФ=DD"))));
	
	Возврат СЗ;
	
КонецФункции // ПолучитьСборкуНаименования()

#КонецОбласти
