///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	//// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	//ПроверкаКонтрагентов.ПриСозданииНаСервереСписокКонтрагентов(Список);
	//// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
	//
	//// Команды1СПАРКРиски
	//СПАРКРиски.ДобавитьПодключаемыеКомандыКонтрагента(ЭтотОбъект, Список, Элементы.Подменю1СПАРКРиски);
	//// Конец Команды1СПАРКРиски
	
	//ОсновнаяУправляющаяКомпания	= ДУ_ОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяУправляющаяКомпания");
	//
	//Список.Параметры.УстановитьЗначениеПараметра("ОсновнаяУправляющаяКомпания", ОсновнаяУправляющаяКомпания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти
