
#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция возвращает признак вида деятельности НПФ
//
// Параметры:
//  Портфель - СправочникСсылка.Портфель - Портфель.
//
// Возвращаемое значение:
//	<Строка> - номер признака вида деятельности.
//
Функция ПризнакВидаДеятельностиНПФ(Портфель) Экспорт
	
	ЗначениеВидаДеятельности = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Портфель, "ВидДеятельности");

	Возврат Строка(Справочники.ВидыДеятельности.НомерПоВидуДеятельности(ЗначениеВидаДеятельности));
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
