#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	Наименование = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Предопределенный Тогда
		ПриведенноеНаименование = СтроковыеФункцииКлиентСервер.ПолучитьИдентификаторИзПредставления_Лкс(Наименование);
		Если Наименование <> ПриведенноеНаименование Тогда 
			ТекстОшибки = СтрШаблон("Для пользовательских субконто есть требование на формат наименования. Предлагаем поменять на %1", ПриведенноеНаименование);  
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ);	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
