#Область ПрограммныйИнтерфейс

Функция ПолучитьСтруктуруДляПечати() Экспорт
	
	Возврат Новый Структура("КоллекцияПечатныхФорм, ОбъектыПечати, ВладелецФормы, Заголовок",,Неопределено,,"Печать документа");
	
КонецФункции

Процедура ПечатьДокументов(СтруктураДанныхДляПечати) Экспорт
	
	Если СтруктураДанныхДляПечати.ОбъектыПечати = Неопределено Тогда
		ОбъектыПечати = Новый СписокЗначений;
	КонецЕсли;
	
	КлючУникальности = Строка(Новый УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	ПараметрыОткрытия.ПараметрКоманды = Новый Массив;
	ПараметрыОткрытия.ПараметрыПечати = Новый Структура;
	ПараметрыОткрытия.Вставить("КоллекцияПечатныхФорм", СтруктураДанныхДляПечати.КоллекцияПечатныхФорм);
	ПараметрыОткрытия.Вставить("ОбъектыПечати", ОбъектыПечати);  	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("ЗаголовокФормы",СтруктураДанныхДляПечати.Заголовок); 	
	ПараметрыОткрытия.ПараметрыПечати = ПараметрыПечати;  	
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, СтруктураДанныхДляПечати.ВладелецФормы, 
		КлючУникальности);
		
КонецПроцедуры

#КонецОбласти
