
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Счет", СчетВторогоПорядка(ПараметрКоманды)));
	ОткрытьФорму("РегистрСведений.НастройкаАналитикиЛицевыхСчетовЕПС.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция СчетВторогоПорядка(СчетЕПС)
	Возврат ПланыСчетов.ЕПС.СчетВторогоПорядка(СчетЕПС);
КонецФункции

