
Процедура ПоступлениеНаРасчетныйСчетПередЗаписью(Ссылка, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
КонецПроцедуры

Процедура ПоступлениеНаРасчетныйСчетПриЗаписи(Ссылка, Отказ) Экспорт
	
КонецПроцедуры

Процедура ПоступлениеНаРасчетныйСчетОбработкаПроведения(Ссылка, Отказ, РежимПроведения) Экспорт 
	
КонецПроцедуры

Процедура ВводВыводЦенныхБумагИзДУОбработкаПроведения(Ссылка, Отказ, РежимПроведения) Экспорт 
	
КонецПроцедуры

Процедура РеглЗаданиеОбработкаБанковскихВыписокПереопределяемый() Экспорт 
	
КонецПроцедуры

Процедура ПодпискаНаСобытиеПриПроведенииВыписокИзАксиомыСОшибками(Ссылка, Отказ, РежимПроведения) Экспорт 
	
КонецПроцедуры

Процедура УпорядочитьТаблицуПоДокументуПриДобавленииСтроки(СтрокаДокумента) Экспорт

КонецПроцедуры

Процедура ОблигацииФормаЭлементаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Параметры) Экспорт
	
КонецПроцедуры