///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "_ДемоНормативноСправочнаяИнформация".
// ОбщийМодуль._ДемоНормативноСправочнаяИнформация.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// _Демо начало примера

// Процедура выполняет все необходимые действия для управления контекстными новостями. Должна вызываться из ПриСозданииНаСервере().
// Она используется в том случае, если выбрана стратегия расчета списка контекстных новостей в ПриСозданииНаСервере.
// Процедура написана специально, чтобы в каждой форме не писать вызов ОбработкаНовостей.КонтекстныеНовости_ПриСозданииНаСервере
//  с большим количеством параметров.
//
// Параметры:
//  Форма                             - ФормаКлиентскогоПриложения - форма, в которой необходимо включить механизм контекстных новостей;
//  ИдентификаторМетаданных           - Строка - Идентификатор метаданных, должен совпадать с таким же идентификатором в самой новости;
//  ИдентификаторФормы                - Строка - Идентификатор формы, должен совпадать с таким же идентификатором в самой новости;
//  ЗаголовокФормыКонтекстныхНовостей - Строка - заголовок формы, которая появляется при нажатии на кнопку показа списка контекстных новостей из формы;
//  ИдентификаторыСобытийПриОткрытии  - Строка, Массив из Строка - строка или массив строк идентификаторов события "ПриОткрытии".
//                                      Если передано какое-то значение, то будет подсчитано количество очень важных контекстных
//                                      новостей. И если это количество > 0, то открывающая форма инициирует
//                                      открытие формы просмотра таких новостей.
//
Процедура КонтекстныеНовости_ПриСозданииНаСервере(
				Форма,
				ИдентификаторМетаданных,
				ИдентификаторФормы,
				ЗаголовокФормыКонтекстныхНовостей = "",
				ИдентификаторыСобытийПриОткрытии = "ПриОткрытии") Экспорт

	НастройкиОтображенияНовостей = Неопределено;
	// Для некоторых форм (где настроена панель контекстных новостей) выведем контекстные новости в панели.
	//Если (ИдентификаторМетаданных = "Справочник.ДУ_Организации") И (ИдентификаторФормы = "ФормаЭлемента") Тогда
	//	НастройкиОтображенияНовостей = Новый Структура;
	//	Если СтрЗаканчиваетсяНа(Форма.Объект.Код, "0") Тогда
	//		НастройкиОтображенияНовостей.Вставить("СпособОтображенияПанелиКонтекстныхНовостей", "Скрыть");
	//	ИначеЕсли СтрЗаканчиваетсяНа(Форма.Объект.Код, "1") Тогда
	//		НастройкиОтображенияНовостей.Вставить("СпособОтображенияПанелиКонтекстныхНовостей", "Автолистание");
	//	ИначеЕсли СтрЗаканчиваетсяНа(Форма.Объект.Код, "2") Тогда
	//		НастройкиОтображенияНовостей.Вставить("СпособОтображенияПанелиКонтекстныхНовостей", "Листание");
	//	Иначе
	//		НастройкиОтображенияНовостей.Вставить("СпособОтображенияПанелиКонтекстныхНовостей", "СписокНовостей");
	//	КонецЕсли;
	//КонецЕсли;

	ОбработкаНовостей.КонтекстныеНовости_ПриСозданииНаСервере(
		Форма,
		ИдентификаторМетаданных,
		ИдентификаторФормы,
		НастройкиОтображенияНовостей, // НастройкиОтображенияНовостей - кнопка должна быть создана
		ЗаголовокФормыКонтекстныхНовостей,
		Ложь, // НЕ создавать реквизит "Новости", он уже должен быть создан в форме
		Новый Структура("ПолучатьНовостиНаСервере, ХранитьМассивНовостейТолькоНаСервере",
			Истина, // Получать новости на сервере
			Ложь), // Передавать с сервера массив структур новостей
		ИдентификаторыСобытийПриОткрытии); // Массив идентификаторов "При открытии" или единственный идентификатор

КонецПроцедуры

#КонецОбласти
