#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура Обновить(Котировка) Экспорт 
	КотировкаОтбор = Новый Структура("ВидКотировки,Биржа,ЦеннаяБумага,Валюта");
	ЗаполнитьЗначенияСвойств(КотировкаОтбор, Котировка); 
	Структура = РегистрыСведений.уа_Котировки.ПолучитьПоследнее(Котировка.Период, КотировкаОтбор);
	Если Структура.Значение <> Котировка.Значение Тогда
		МенеджерЗаписи = РегистрыСведений.уа_Котировки.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Котировка);
		МенеджерЗаписи.Записать(Истина);		
	КонецЕсли;                     	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли