#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс
Функция НайтиГруппуПоТипуЦББР(ТипЦББР) Экспорт	
	Если ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON1 Тогда 
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.ГосЦБ_НаРынкеЦБ;
	ИначеЕсли ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON2  Тогда 
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.МуниципальныеОблигации;
	ИначеЕсли ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON3 Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.BON4  Тогда
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.ОблигацииРФ;
	ИначеЕсли ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS1 Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS3  
		Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS2 Или ТипЦББР = Перечисления.уа_ТипыЦенныхБумагБР.SHS4  Тогда 
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.АкцииРосАО;
	Иначе
		ГруппаФИ = Справочники.уа_ФинансовыеИнструменты.Прочее;
	КонецЕсли; 
	
	Возврат ГруппаФИ;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
#КонецЕсли