// ОБЩИЕ ФУНКЦИИ
//

// Функция получает список макетов оформления 
//
// Параметры: нет
//
// Возвращаемое значение:
//  СписокМакетовОформления - список с макетами оформления
//
Функция ПолучитьСписокМакетовОформления() Экспорт
	
	СписокМакетовОформления = Новый СписокЗначений;
	Для Каждого ОбщийМакет Из Метаданные.ОбщиеМакеты Цикл
		Если ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.МакетОформленияКомпоновкиДанных Тогда
			СписокМакетовОформления.Добавить(ОбщийМакет.Имя, ОбщийМакет.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	СписокМакетовОформления.Добавить("Основной");
	СписокМакетовОформления.Добавить("Яркий");
	СписокМакетовОформления.Добавить("Море");
	СписокМакетовОформления.Добавить("Арктика");
	СписокМакетовОформления.Добавить("Зеленый");
	СписокМакетовОформления.Добавить("Античный");
	
	Возврат СписокМакетовОформления;
	
КонецФункции

// Функция получает наименование договора ДУ 
//
// Параметры: 
//  Организация - договор ДУ
//
// Возвращаемое значение:
//  Организация.Наименование - наименование договора ДУ
//
Функция ПолучитьТекстОбособленныхПодразделений(Организация) Экспорт
	
	ТекстОрганизации = "";
	//
	//СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация);
	//ТекстОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	//Если ПустаяСтрока(ТекстОрганизации) Тогда
	//	ТекстОрганизации = СведенияОбОрганизации.Представление;
	//КонецЕсли;
	//
	//ТекстОрганизации = ТекстОрганизации + " с обособленными подразделениями";
	
	Возврат Организация.Наименование;
	
КонецФункции

// Функция получает наименование договора ДУ 
//
// Параметры: 
//  Организация - договор ДУ
//  ВключатьОбособленныеПодразделения - параметр не используется
//
// Возвращаемое значение:
//  Организация.Наименование - наименование договора ДУ
//
Функция ПолучитьТекстОрганизация(Организация = Неопределено, ВключатьОбособленныеПодразделения = Ложь) Экспорт
	
	ТекстОрганизации = "";
	//Попытка
	//	Если ЗначениеЗаполнено(Организация) Тогда
	//		Если ВключатьОбособленныеПодразделения Тогда
	//			ТекстОрганизации = ПолучитьТекстОбособленныхПодразделений(Организация);
	//		Иначе
	//			СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Организация);
	//			ТекстОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
	//			Если ПустаяСтрока(ТекстОрганизации) Тогда
	//				ТекстОрганизации = СведенияОбОрганизации.Представление;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//Исключение
	//	// Запись в журнал регистрации не требуется
	//КонецПопытки;
	
	Возврат Организация.Наименование;
	
КонецФункции

// Функция всегда возвращает истину
//
// Параметры: нет
//
// Возвращаемое значение:
//  Истина
//
Функция ДоступностьУчетаПоПодразделениям() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ТипыСвязанныеСОрганизацией() Экспорт
	
	Возврат БухгалтерскийУчетПереопределяемый.ТипыСвязанныеСОрганизацией();
	
КонецФункции
