#Область ПрограммныйИнтерфейс

Процедура ДополнитьФормуБанки(ЭтаФорма) Экспорт
	Попытка
		
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("ДУ_ДополнительныеРеквизиты",Тип("ГруппаФормы"),ЭтаФорма);
		НовыйЭлементФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлементФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
		НовыйЭлементФормы.ОтображатьЗаголовок = Истина;
		НовыйЭлементФормы.Заголовок = "Дополнительные реквизиты (ДУ)";
		НовыйЭлементФормы.Объединенная = Истина;  		
		
		НовыйЭлементФормы = ЭтаФорма.Элементы.Добавить("УА_Контрагент",Тип("ПолеФормы"),ЭтаФорма.Элементы.ДУ_ДополнительныеРеквизиты);
		НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлементФормы.ПутьКДанным = "Объект.УА_Контрагент";
		НовыйЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
		
	Исключение
	КонецПопытки;
КонецПроцедуры	


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
