
#Область СлужебныеПроцедурыИФункции

// Настраивает виды контактной информации в конфигурации при обновлении.
Процедура ЗаполнитьНедостающиеДанные(Параметры = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	//ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	//Если Не ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
	//	ВалютаРегламентированногоУчета = УА_ПривилегированныйСервер.ВалютаРеглУчета();
	//	Если ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
	//		Константы.ВалютаРегламентированногоУчета.Установить(ВалютаРегламентированногоУчета);			
	//	КонецЕсли; 				
	//КонецЕсли; 	
	//ЗаписатьВЖурналЗавершениеПроцедуры("ЗаполнитьВалютаРегламентированногоУчета");
				
	ЗаписатьВЖурналЗавершениеПроцедуры("ЗаполнитьНедостающиеДанные");
	
КонецПроцедуры

// Записывает в журнал регистрации событие завершения процедуры.
Процедура ЗаписатьВЖурналЗавершениеПроцедуры(ИмяПроцедуры, ИзмененоОбъектов = Неопределено)
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Завершение процедуры ""%1"".'"), ИмяПроцедуры);
	ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Обновление ДУ",
		УровеньЖурналаРегистрации.Информация, , , Текст);
	
КонецПроцедуры

#КонецОбласти