#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

/////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//Возвращает курсы валют на дату
//
// Параметры:
//  - Дата - Дата получения курсов валют
//
// Возвращаемое значение:
// Соответствие Ключ = Валюта, Значение = Структура(Курс,Кратность)
//
Функция КурсыВалютыПоДату(Валюта,ДатаКурсов, ИнформационнаяПлощадка = "") Экспорт 
	
	КурсыВалют = Новый Соответствие;
	СтруктураКурсов = Новый Структура("Курс, Кратность");
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаКурсов", ДатаКурсов);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.Текст = "ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	               |	КурсыВалютСрезПоследних.Курс КАК Курс,
	               |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	               |ИЗ
	               |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурсов, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
				   
	Выборка = Запрос.Выполнить().Выбрать();
			
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураКурсов,Выборка);
	Иначе
		СтруктураКурсов.Курс = 1; 
		СтруктураКурсов.Кратность = 1;
	КонецЕсли;
			
	Возврат СтруктураКурсов;
	
КонецФункции

#КонецЕсли	 
