
// Обертка, которая просто вызывает ОбщегоНазначения.ЗначениеРеквизитаОбъекта
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
	Возврат Результат;
	
КонецФункции 

// Обертка, которая просто вызывает ОбщегоНазначения.ЗначенияРеквизитовОбъекта
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты) Экспорт
	
	Результат = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты);
	
	Возврат Результат;
	
КонецФункции

// Обертка, которая просто вызывает ОбщегоНазначения.ИмяТаблицыПоСсылке
//
Функция ИмяТаблицыПоСсылке(Ссылка) Экспорт
	
	Результат = ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьКлассификатор(ИмяМакета) Экспорт

	Классификатор = Новый Соответствие();
	
	Макет = Справочники.Контрагенты.ПолучитьМакет(ИмяМакета);
	
	ТекущаяОбласть = Макет.Область("Классификатор");

	Если ТекущаяОбласть <> Неопределено Тогда	
	
		Для НомерСтр = ТекущаяОбласть.Верх По ТекущаяОбласть.Низ Цикл
			
			// Перебор строк макета.
			КодПоказателя = СокрП(Макет.Область(НомерСтр, 1).Текст);
			Название      = СокрП(Макет.Область(НомерСтр, 2).Текст);
			
			Если КодПоказателя = "###" Тогда
				Прервать;
			ИначеЕсли ПустаяСтрока(КодПоказателя) Тогда
				Продолжить;
			Иначе
				Классификатор.Вставить(КодПоказателя, Название);
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированноеСоответствие(Классификатор);

КонецФункции

#Область УниверсальныеСопоставления

Процедура СоздатьСопоставление(КонтекстСопоставления, Брокер, ВнешнийКод, Актив) Экспорт
	
	Документы.ОтчетБрокера.СоздатьСопоставление(КонтекстСопоставления, Брокер, ВнешнийКод, Актив);
	
КонецПроцедуры

Функция ЕстьСопоставление(КонтекстСопоставления, КонтекстОбъекта, ВнешнийОбъект, НашОбъект) Экспорт
	
	ТекущееСопоставление = Документы.ОтчетБрокера.НайтиСопоставление(КонтекстСопоставления, КонтекстОбъекта, ВнешнийОбъект);
	Возврат НашОбъект = ТекущееСопоставление;
	
КонецФункции

Функция КонтекстСопоставленияАктив() Экспорт
	Возврат "Отчет брокера: актив";	
КонецФункции
 
Функция КонтекстСопоставленияБиржа() Экспорт
	Возврат "Отчет брокера: биржа";	
КонецФункции

Функция КонтекстСопоставленияКонтрагент() Экспорт
	Возврат "Отчет брокера: контрагент";	
КонецФункции


#КонецОбласти 
