
Функция ПолучитьПараметрПортфеля(Портфель, Параметр, Дата) Экспорт
	Возврат УправлениеПараметрамиПортфеля.ПолучитьПараметрПортфеля(Портфель, Параметр, Дата);
КонецФункции

Функция ИсторическиеЗначенияПараметра(Знач Портфель, Знач Параметр) Экспорт     //NFO-1206
	Возврат УправлениеПараметрамиПортфеля.ИсторическиеЗначенияПараметра(Портфель, Параметр);
КонецФункции

Функция ЗначениеПараметраПортфеля(Знач Портфель, Знач Параметр, Знач Дата = '00010101') Экспорт //NFO-1206
	
	Возврат УправлениеПараметрамиПортфеля.ЗначениеПараметраПортфеля(Портфель, Параметр, Дата);
	
КонецФункции

Функция ПравилаОкругленияПоВидуАктива(УчетнаяПолитика, ВидАктива) Экспорт
	
	ТаблицаПравилПоВидамАктивов = УчетнаяПолитика.ПравилаОкругленияКотировок.Выгрузить();
	
	ВидыАктивов	= Новый Массив;
	УправлениеВзаиморасчетами.ПолучитьСписокВышестоящихГрупп(ВидыАктивов, ВидАктива);
	ВидыАктивов.Добавить(ВидАктива);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Правила.ВидАктива,
		|	Правила.НаборПравил КАК НаборПравил
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	&ТаблицаПравил КАК Правила
		|ГДЕ
		|	Правила.ВидАктива В(&ВидыАктивов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ВидАктива,
		|	ВТ.НаборПравил
		|ИЗ
		|	ВТ КАК ВТ";

	Запрос.УстановитьПараметр("ВидыАктивов", ВидыАктивов);
	Запрос.УстановитьПараметр("ТаблицаПравил", ТаблицаПравилПоВидамАктивов);
	ПравилаОкругленияПоВидуАктива = Запрос.Выполнить().Выгрузить();
	
	Возврат ПравилаОкругленияПоВидуАктива;
	
КонецФункции

Функция АктуальныйКэш(Портфель, Дата) Экспорт

	  Возврат Новый Соответствие;

КонецФункции
 