///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "_ДемоИнтернетПоддержкаПользователей._ДемоРаботаСКлассификаторами".
// ОбщийМодуль._ДемоРаботаСКлассификаторамиВызовСервера.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Проверяет наличие доступных обновлений классификаторов в сервисе классификаторов
// или из кэша поставляемых данных и загружает файлы.
//
// Параметры:
//  Идентификаторы - Массив - идентификаторы классификаторов в сервисе,
//                   файлы которых необходимо загрузить.
//
// Возвращаемое значение:
//  Структура - информация о доступных обновлениях:
//    * КодОшибки - Строка - строковый код возникшей ошибки, который
//                  может быть обработан вызывающим функционалом:
//                    - <Пустая строка> - обновление выполнено успешно;
//                    - "ОбновлениеНеТребуется" - обновление не обнаружено;
//                    - "НеверныйЛогинИлиПароль" - неверный логин или пароль;
//                    - "ПревышеноКоличествоПопыток" - превышено количество попыток
//                      получения обновления с некорректным логином и паролем;
//                    - "ОшибкаПодключения" - ошибка при подключении к сервису;
//                    - "ОшибкаСервиса" - внутренняя ошибка сервиса;
//                    - "НеизвестнаяОшибка" - при получении информации возникла
//                      неизвестная (не обрабатываемая) ошибка;
//                    - "НеОбработан" - файл классификатора успешно загружен, но не обработан.
//                      Ошибка может возникнуть, если отсутствуют алгоритмы обработки файла
//                      см. процедуру РаботаСКлассификаторамиПереопределяемый.ПриЗагрузкеКлассификатора
//                      и ИнтеграцияПодсистемБИП.ПриЗагрузкеКлассификатора;
//                    - "СервисВременноНеДоступен" - на сервер ведутся регламентные работы;
//                    - "НеизвестныйКлассификаторИлиПрограмма" - классификатор или программа
//                      в сервисе не обнаружен по переданному идентификатору;
//                    - "ФайлНеЗагружен" - при загрузке файлов классификатора возникли ошибки;
//                    - "НетДоступаКПрограмме" - отсутствует доступ к программе на Портале 1С:ИТС;
//    *СообщениеОбОшибке  - Строка, ФорматированнаяСтрока - сообщение об ошибке для пользователя;
//    *ИнформацияОбОшибке - Строка, ФорматированнаяСтрока - сообщение об ошибке для администратора;
//    *ДанныеФайла        - ДвоичныеДанные, Неопределено - содержит данные файла;
//
Функция ПолучитьФайлыКлассификаторов(Идентификаторы) Экспорт
	
	РезультатОперации = РаботаСКлассификаторами.ПолучитьФайлыКлассификаторов(Идентификаторы);
	РезультатОперации.Вставить("ЭтоПолноправныйПользователь", Пользователи.ЭтоПолноправныйПользователь());
	
	Если РезультатОперации.ДанныеКлассификаторов <> Неопределено И РезультатОперации.ДанныеКлассификаторов.Количество() <> 0 Тогда
		РезультатОперации.Вставить("ДанныеФайла", ПолучитьИзВременногоХранилища(РезультатОперации.ДанныеКлассификаторов[0].АдресФайла));
	Иначе
		РезультатОперации.Вставить("ДанныеФайла", Неопределено);
	КонецЕсли;
	
	РезультатОперации.ДанныеКлассификаторов = Неопределено;
	
	Возврат РезультатОперации;
	
КонецФункции

#КонецОбласти
