#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДополнительныйОтбор") И ТипЗнч(Параметры.ДополнительныйОтбор) = Тип("Массив") Тогда
		
		ДобавитьДополнительныеОтборы(Параметры.ДополнительныйОтбор);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаСервере
Процедура ДобавитьДополнительныеОтборы(Отбор, ГруппаОтбора = Неопределено)
	
	Для Каждого Элемент Из Отбор Цикл
		
		Если ТипЗнч(Элемент) = Тип("Структура") Тогда
			Если ГруппаОтбора = Неопределено Тогда
				ОбластьДобавления = Список.Отбор;
			Иначе
				ОбластьДобавления = ГруппаОтбора;
			КонецЕсли; 
			
			ЭлементКомпоновки = ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ОбластьДобавления, Элемент.ИмяПоля, ВидСравненияКомпоновкиДанных.Равно,,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто, Элемент.ИмяПоля); 
			ЗаполнитьЗначенияСвойств(ЭлементКомпоновки, Элемент);
		ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда 
			Группа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, "Или", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
			ДобавитьДополнительныеОтборы(Элемент, Группа);
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

