
#Область ПРОГРАМНЫЙ_ИНТЕРФЕЙС 

Функция НомерПоВидуДеятельности(ПризнакВидовДеятельности) Экспорт 
		
	НомерПоВидуДеятельности = 0;
	
	Если ПризнакВидовДеятельности = Справочники.ВидыДеятельности.ОбязательноеПенсионноеСтрахование Тогда 
		НомерПоВидуДеятельности = 1;
	ИначеЕсли ПризнакВидовДеятельности =  Справочники.ВидыДеятельности.НегосударственноеПенсионноеОбеспечение Тогда 
		НомерПоВидуДеятельности = 2;
	ИначеЕсли ПризнакВидовДеятельности =  Справочники.ВидыДеятельности.УставнаяДеятельность Тогда 
		НомерПоВидуДеятельности = 3;
	КонецЕсли;
	
	Возврат НомерПоВидуДеятельности;
	
КонецФункции

#КонецОбласти