
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПодсказку();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПодсказку()	
	  			
	ПодсказкаШаблон = "Пример шаблона:
						|Результат = 
						|Контекст.Счет.Код  + 
						|Справочники.Валюты.КодВалютыДляЛицевогоСчета(Контекст.Валюта) + 
						|Справочники.Портфели.ПризнакДоверительногоУправления(Контекст.Портфель) + 
						|Справочники.Портфели.ПризнакВидаДеятельностиНПФ(Контекст.Портфель) + 
						|ДополнитьЛидирующимиНулями(ЗначениеРеквизитаАналитики(Контекст, ""Договоры"", ""КодДляЛицевогоСчета""), 5) + 
						|ДополнитьЛидирующимиНулями(Контекст.ПорядковыйНомер, 5);";
			
	Элементы.Шаблон.Подсказка = ПодсказкаШаблон;
	
КонецПроцедуры

#КонецОбласти