////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С ВАЛЮТАМИ

//Возвращает курсы валют на дату
//
// Параметры:
//  - Дата - Дата получения курсов валют
//
// Возвращаемое значение:
// Соответствие Ключ = Валюта, Значение = Структура(Курс,Кратность)
//
Функция КурсыВалютПоДате(БазоваяВалюта, ДатаКурсов, ИнформационнаяПлощадка = "") Экспорт
	
	Возврат РегистрыСведений.КурсыВалют.КурсыВалютПоДате(БазоваяВалюта, ДатаКурсов, ИнформационнаяПлощадка);
	
КонецФункции

// Формирует таблицу курсов за каждый день в кэше вызова сервера
//
// Параметры:
//  ДатаНачала  	- Дата - Дата начала получения курсов
//  ДатаОкончания 	- Дата - Дата окончания получения курсов 
//
// Возвращаемое значение:
//   ТаблицаЗначений   - Таблица курсов на каждый день по всем валютам
//
Функция КурсыВалютЗаПериод(БазоваяВалюта, ДатаНачала, ДатаОкончания, ИнформационнаяПлощадка = "") Экспорт
	
	Возврат РегистрыСведений.КурсыВалют.ТаблицаКурсовВалютЗаПериод(БазоваяВалюта, ДатаНачала, ДатаОкончания, ИнформационнаяПлощадка);
	
КонецФункции

Функция ПолучитьКурсВалюты(БазоваяВалюта, Валюта, ДатаКурса, ИнформационнаяПлощадка = "") Экспорт
	
	Возврат МодульВалютногоУчета.ПолучитьКурсВалюты(БазоваяВалюта, Валюта, ДатаКурса, ИнформационнаяПлощадка);
	
КонецФункции
 