////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ФУНКЦИИ

// Функция получает список макетов оформления 
//
// Параметры: нет
//
// Возвращаемое значение:
//  СписокМакетовОформления - список с макетами оформления
//
Функция ПолучитьСписокМакетовОформления() Экспорт
	
	СписокМакетовОформления = Новый СписокЗначений;
	Для Каждого ОбщийМакет Из Метаданные.ОбщиеМакеты Цикл
		Если ОбщийМакет.ТипМакета = Метаданные.СвойстваОбъектов.ТипМакета.МакетОформленияКомпоновкиДанных Тогда
			СписокМакетовОформления.Добавить(ОбщийМакет.Имя, ОбщийМакет.Синоним);
		КонецЕсли;
	КонецЦикла;
	
	СписокМакетовОформления.Добавить("Основной");
	СписокМакетовОформления.Добавить("Яркий");
	СписокМакетовОформления.Добавить("Море");
	СписокМакетовОформления.Добавить("Арктика");
	СписокМакетовОформления.Добавить("Зеленый");
	СписокМакетовОформления.Добавить("Античный");
	
	Возврат СписокМакетовОформления;
	
КонецФункции

// Функция получает наименование договора ДУ 
//
// Параметры: 
//  Организация - договор ДУ
//  ВключатьОбособленныеПодразделения - параметр не используется
//
// Возвращаемое значение:
//  Организация.Наименование - наименование договора ДУ
//
Функция ПолучитьТекстПортфеля(Портфель = Неопределено) Экспорт
	

	
	Возврат ?(ЗначениеЗаполнено(Портфель), Портфель.ПолноеНаименование, "");
	
КонецФункции

// Функция всегда возвращает истину
//
// Параметры: нет
//
// Возвращаемое значение:
//  Истина
//
Функция ДоступностьУчетаПоПодразделениям() Экспорт
	
	Возврат Истина;
	
КонецФункции