
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = УА_ПривилегированныйСервер.ВалютаРеглУчета(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
			Объект.ВалютаВзаиморасчетов = ВалютаРегламентированногоУчета;			
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НаименованиеНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПоказатьВыборИзСписка(ОписаниеОповещения, ПолучитьСборкуНаименования(), Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеНачалоВыбораЗавершение(ВыбранноеЗначение, ДопПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Наименование = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получет сборку наименования
//
// Параметры:
//  Отсутствуют
//
// Возвращаемое значение:
//   СписокЗначений
//
&НаКлиенте
Функция ПолучитьСборкуНаименования()
	
	СЗ = Новый СписокЗначений;
	
	// Стандартная
	НомерНорм = СокрЛП(Объект.НомерДоговора);
	
	Если НомерНорм <> "" тогда
		НомерНорм = ?(Найти(НомерНорм, "№")=0, "№" + НомерНорм, НомерНорм);
	КонецЕсли;
	Сборка1 = НомерНорм + ?(Объект.ДатаДоговора = '00010101', "", " от " + Строка(Формат(Объект.ДатаДоговора, "ДЛФ=DD")))
		+" "+Строка(Объект.Владелец);
	Сборка1 = Сборка1+?(Объект.ВалютаВзаиморасчетов.Пустая(), "", " "+Строка(Объект.ВалютаВзаиморасчетов));  
			
	СЗ.Добавить(Сборка1);
	
	Возврат СЗ;
	
КонецФункции // ПолучитьСборкуНаименования()

#КонецОбласти
