
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Источник     = ПараметрыВыполненияКоманды.Источник;
	Уникальность = ПараметрКоманды;
	  	
	фиксНастройки = Новый НастройкиКомпоновкиДанных;
			
	ПараметрыФормы = Новый Структура; 		
			
	эОтбор                = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	эОтбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Эмитент");
	эОтбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	эОтбор.ПравоеЗначение = ПараметрКоманды;
	эОтбор.Использование  = Истина;
	
	эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки); 	
			
	ОткрытьФорму("Справочник.уа_ФинансовыеИнструменты.Форма.ФормаСпискаБезГрупп",ПараметрыФормы,Источник,Уникальность,ПараметрыВыполненияКоманды.Окно); 	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
