#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Функция выполняет поиск Договора контрагента по Владельцу Номеру и дате договора.
//Владелец - СправочникСсылка.Контрагенты
// Номер - Тип - Строка(50)
// ДатаДоговора - Тип - Дата
// Ссылка - Тип - СправочникСсылка.ДУ_ДоговорыКонтрагентов 
Функция НайтиДоговорПоВладельцуНомерДата(Знач Владелец, Знач Номер, Знач ДатаДоговора) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.НомерДоговора = &НомерДоговора
		|	И ДоговорыКонтрагентов.ДатаДоговора = &ДатаДоговора";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НомерДоговора", СокрЛП(Номер));
	Запрос.УстановитьПараметр("ДатаДоговора", ДатаДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НайдДоговор = ВыборкаДетальныеЗаписи.ДоговорКонтрагента;
		
	Иначе
		
		НайдДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат НайдДоговор;	
		
КонецФункции

#КонецОбласти
	
#КонецЕсли