#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Функция выполняет поиск Договора контрагента по Владельцу Номеру и дате договора.
//Владелец - СправочникСсылка.Контрагенты
// Номер - Тип - Строка(50)
// ДатаДоговора - Тип - Дата
// Ссылка - Тип - СправочникСсылка.ДУ_ДоговорыКонтрагентов 
Функция НайтиБанковскийСчетПоВладельцуНомеру(Знач Владелец, Знач НомерСчета) Экспорт
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчета.Ссылка КАК БанковскийСчет
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец = &Владелец
		|	И БанковскиеСчета.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НомерСчета", СокрЛП(НомерСчета));
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НайдБанковскийСчет = ВыборкаДетальныеЗаписи.БанковскийСчет;
		
	Иначе
		
		НайдБанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат НайдБанковскийСчет;	
		
КонецФункции

#КонецОбласти
	
#КонецЕсли