///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Настраивает виды контактной информации в конфигурации при обновлении.
Процедура НастроитьВидыКонтактнойИнформации() Экспорт
	
	// Справочник "Пользователи"
	ВидОбъект = Справочники.ВидыКонтактнойИнформации.ТелефонПользователя.ПолучитьОбъект();
	ВидОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбъект); // АПК:1327 Конкурентная работа маловероятна.
	
	ВидОбъект = Справочники.ВидыКонтактнойИнформации.EmailПользователя.ПолучитьОбъект();
	ВидОбъект.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбъект); // АПК:1327 Конкурентная работа маловероятна.
			
	// Справочник "Контрагенты"
	ВидОбъект = Справочники.ВидыКонтактнойИнформации.СправочникКонтрагенты.ПолучитьОбъект();
	ВидОбъект.Используется = Истина;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(ВидОбъект);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.АдресКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 1;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	ПараметрыВида.Используется    = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 2;
	ПараметрыВида.НастройкиПроверки.ТолькоНациональныйАдрес = Истина;
	ПараметрыВида.Используется = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.РазрешитьВводНесколькихЗначений = Истина;
	ПараметрыВида.Порядок = 3;
	ПараметрыВида.Используется = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Истина;
	ПараметрыВида.Порядок = 4;
	ПараметрыВида.Используется    = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
	
	ПараметрыВида = УправлениеКонтактнойИнформацией.ПараметрыВидаКонтактнойИнформации(Перечисления.ТипыКонтактнойИнформации.Skype);
	ПараметрыВида.Вид = Справочники.ВидыКонтактнойИнформации.SkypeКонтрагенты;
	ПараметрыВида.Порядок = 5;
	ПараметрыВида.МожноИзменятьСпособРедактирования = Ложь;
	ПараметрыВида.Используется = Истина;
	УправлениеКонтактнойИнформацией.УстановитьСвойстваВидаКонтактнойИнформации(ПараметрыВида);
					
КонецПроцедуры

// Вызывается при обновлении информационной базы для учета переименований подсистем и ролей в конфигурации.
// В противном случае, возникнет рассинхронизация между метаданными конфигурации и 
// элементами справочника ИдентификаторыОбъектовМетаданных, что приведет к различным ошибкам при работе конфигурации.
//
// В этой процедуре последовательно для каждой версии конфигурации задаются переименования только подсистем и ролей, 
// а переименования остальных объектов метаданных задавать не следует, т.к. они обрабатываются автоматически.
//
// Параметры:
//	Итог - ТаблицаЗначений - таблица переименований, которую требуется заполнить.
//		См. ОбщегоНазначения.ДобавитьПереименование.
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.Подсистема_ДемоИнструментыРазработчика",
		"Роль._ДемоПодсистема_ДемоИнструментыРазработчика",
		Метаданные.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.Подсистема_ДемоНормативноСправочнаяИнформация",
		"Роль._ДемоПодсистема_ДемоНормативноСправочнаяИнформация",
		Метаданные.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.ПодсистемаБазоваяФункциональностьБИП",
		"Роль._ДемоПодсистемаБазоваяФункциональностьБИП",
		Метаданные.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.ПодсистемаНовости",
		"Роль._ДемоПодсистемаНовости",
		Метаданные.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.ПодсистемаОблачныйАрхив",
		"Роль._ДемоПодсистемаОблачныйАрхив",
		Метаданные.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.ПодсистемаПодключение1СТакском",
		"Роль._ДемоПодсистемаПодключение1СТакском",
		Метаданные.Имя);
	
	ОбщегоНазначения.ДобавитьПереименование(
		Итог,
		"2.2.2.3",
		"Роль.ПодсистемаСПАРКРиски",
		"Роль._ДемоПодсистемаСПАРКРиски",
		Метаданные.Имя);
	
КонецПроцедуры

#КонецОбласти