#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НайтиПоКоду(Идентификатор) Экспорт
	КатегорияАктива = Неопределено;
	
	Если Идентификатор = "Облигация" Тогда
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.Облигация;
	ИначеЕсли Идентификатор = "Акция" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.Акция;
	ИначеЕсли Идентификатор = "Ипотечный сертификат" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.ИпотечныйСертификатУчастия;
	ИначеЕсли Идентификатор = "Депозитарная расписка" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.ДепозитарнаяРасписка;
	ИначеЕсли Идентификатор = "Фонд" Тогда 
		КатегорияАктива 	= Перечисления.уа_КатегорииАктива.Пай;
	КонецЕсли;
	
	Возврат КатегорияАктива;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли